tutorials/rheoEFoam/ICEO/NernstPlanckCoupled/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

coupledSolvers
{
  Uptau
  {
    solveCoupledUp true;
    solveCoupledTau false;
     
    saveSystem true;
    robustSumCheck true;
    updatePrecondFrequency 1000; 
    updateMatrixCoeffs false; 
  }
  
  ciPsi
  {
    solveWithUptau    false;
    
    saveSystem true;
    robustSumCheck  true;
    updatePrecondFrequency 1; 
    updateMatrixCoeffs true;   
  }
}

solvers
{
    "(p|phiE|psi|U)"
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          0.;
        smoother        DIC;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        
    }

    "(C|ci)"
    {

        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0;
    }
 
}

PostProcessing
{

functions
 (
 
  ciMonitor
   {
     funcType          calcBalance;
     enabled           true;
     evaluateInterval  1;  
   }
   
  jMonitor
   {
     funcType          calcJpatch;
     ListOfPatches
      (
        "cylinder"
      );
     enabled           true;
     evaluateInterval  1;
   }
   
 );
 
}

electricControls
{
  nIterPNP         2;
  
  phiEEqn
   {
      residuals 1e-7;
      maxIter      1;
   }

  psiEqn
   {
      residuals 1e-7;
      maxIter      1;
   }
   
   ciEqn
   {
      residuals 1e-7;
      maxIter      1;
   }
}

SIMPLE
{
    solveFluid      true;
     
    nInIter         1;
    nNonOrthogonalCorrectors 2;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
       
    }
}

relaxationFactors
{
   
}

// ************************************************************************* //
